# Dependencies installed via `brew bundle`
# https://github.com/Homebrew/homebrew-bundle

# Fonts
cask "font-fira-code-nerd-font"
cask "font-mononoki-nerd-font"

# Shells
brew "bash"         # because macOS ships with 3.2, from 2006
brew "fish"         # shell of choice


# General shell tools
brew "bat"          # cat replacement
brew "eza"          # ls replacement
brew "fd"           # find replacement
brew "gum"          # shell TUI tool
brew "ripgrep"
brew "joshmedeski/sesh/sesh"
brew "starship"     # shell powerline
brew "trash"        # rm to trashcan
brew "zoxide"       # directory autojumping


# Git + tools
brew "git"
brew "gitui"        # git TUI of choice
brew "diff-so-fancy"
brew "ghq"          # git repo management
brew "lefthook"     # Git pre-commit system
brew "chezmoi"      # dotfile management


# Misc file format tools
brew "jq"           # JSON querying/manipulation
brew "noahgorstein/tap/jqp" # jq playground
brew "yq"           # YAML querying/manipulation


# Network tools
brew "doggo"				# dig alternative


# Kubernetes tools
brew "kubectl"      # Kubernetes CLI tool
brew "kubectx"      # Kubernetes context/namespace switching
brew "k9s"					# Kubernets TUI tool

# macOS apps
brew "jordanbaird-ice" # https://github.com/jordanbaird/Ice


# TODO: Stuff to categorize

brew "btop"         # system info, like htop
brew "ctop"         # top for Docker containers
brew "entr"         # Monitor files, run commands on changes
brew "fzf"          # fuzzy finder
cask "kitty"				# Terminal of choice
brew "neovim"
brew "pwgen"
brew "terraform"
brew "tmux"
brew "trivy"

##
## Taps
##

# Mob programming handoff
tap "remotemobprogramming/brew"
brew "remotemobprogramming/brew/mob"
