# Dependencies installed via `brew bundle`
# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/core"

brew "bat"          # cat replacement
brew "btop"         # system info, like htop
brew "chezmoi"      # dotfile management
brew "ctop"         # top for Docker containers
brew "diff-so-fancy"
brew "exa"          # ls replacement
brew "fd"           # find replacement
brew "fish"         # shell of choice
brew "fzf"          # fuzzy finder
brew "ghq"          # git repo management
brew "git"
brew "go"
brew "gofumpt"      # Stricter gofmt
brew "jq"           # JSON querying/manipulation
brew "kubectl"      # Kubernetes CLI tool
brew "kubectx"      # Kubernetes context/namespace switching
brew "lefthook"     # Git pre-commit system
brew "mockery"      # Go mock generator
brew "neovim"
brew "pwgen"
brew "ripgrep"
brew "starship"     # shell powerline
brew "staticcheck"  # static code analysis for Go
brew "terraform"
brew "tfsec"
brew "tig"          # git interface
brew "trash"        # rm to trashcan
brew "yq"           # YAML querying/manipulation

# Improved deterministic goimports
tap "incu6us/homebrew-tap"
brew "incu6us/homebrew-tap/goimports-reviser"
