jorgebucaran/fisher
PatrickF1/fzf.fish
evanlucas/fish-kubectl-completions
jorgebucaran/autopair.fish
jorgebucaran/nvm.fish
jorgebucaran/replay.fish
catppuccin/fish
rose-pine/fish
